#pragma once

#include "Item/ItemBase.h"

class Haetataki
	: public ItemBase
{
public:

	Haetataki();
	~Haetataki();

	/*****************************************************************************************
	* @brief    初期化
	******************************************************************************************/
	void Init() override;


	/*****************************************************************************************
	* @brief    更新処理
	*****************************************************************************************/
	void Update() override;


	/*****************************************************************************************
	* @brief    描画処理
	*****************************************************************************************/
	void Draw(D3DXMATRIX& View, D3DXMATRIX& Proj, LIGHT& Light, CAMERA& Camera) override;


	/*****************************************************************************************
	* @brief    アイテムの共通処理
	*****************************************************************************************/
	void Spawn()	override; // 出現
	void OnGround() override; // 取得待機
	void Have()		override; // 取得
	void Use()		override; // 使用
	void Throw()	override; // 投擲
	void Destroy()	override; // 消滅

private:

	float m_tGravity; // 重力加速度(簡易版)

};