#pragma once

/***********************************************************************
*	カメラクラス.								制作者 : 甲把
**/
class CCamera
{
public:
	CCamera();
	~CCamera();

//======================================================================
// 	   外部で呼び出す関数.
//======================================================================
	//--- ビューの変換処理 ---.
	void UpdateView(const CAMERA& camera, D3DXMATRIX& view) const;
	//--- プロジェクションの変換処理 ---.
	void UpdateProjection(D3DXMATRIX& proj);

private:
//======================================================================
// 	   内部で使用する変数.
//======================================================================
	D3DXVECTOR3		m_vUpVec;	//上方（ベクトル）.	

	float			m_Fov_y;	//y方向の視野角.
	float			m_Aspect;	//アスペクト.
	float			m_Near_z;	//近いビュー平面のz値.
	float			m_Far_z;	//遠いビュー平面のz値.
};