#pragma once
#include "GameObject/MeshObject/StaticMesh/CStaticMeshObject.h"

class ItemBase;
class CPlayerManager;

class ItemManager:
	public CStaticMeshObject
{
public:
	ItemManager();
	~ItemManager();

	/*****************************************************************************************
	* @brief    生成
	*****************************************************************************************/
	HRESULT Create();


	/*****************************************************************************************
	* @brief    データを読み込む
	*****************************************************************************************/
	HRESULT LoadData();


	/*****************************************************************************************
	* @brief    初期化
	*****************************************************************************************/
	void Init();


	/*****************************************************************************************
	* @brief    更新処理
	*****************************************************************************************/
	void Update(std::unique_ptr<CPlayerManager>& players) ;

	//継承が邪魔になったので切る
	void Update() override;


	/*****************************************************************************************
	* @brief    描画処理
	*****************************************************************************************/
	void Draw(D3DXMATRIX& View, D3DXMATRIX& Proj, LIGHT& Light, CAMERA& Camera) override;


	/*****************************************************************************************
	* @brief    破壊フラグを参照して破壊を行う関数
	*****************************************************************************************/
	void DestroyItem(); 

	//現在出現中のアイテムの数を取得
	int GetItemVectorNum() { return m_pItems.size(); }

	//出現中のアイテムの位置を取得
	D3DXVECTOR3 GetItemPos(int i);

private:

	// アイテムのコンテナ
	std::vector<std::unique_ptr<ItemBase>> m_pItems;

};