#pragma once
#include "CSound.h"		//サウンドクラス

/**************************************************
*	サウンドマネージャークラス
*	担当者: 佐藤　隼斗
* 
*	@brief    サウンドの管理を行うクラス.
**/
class CSoundManager
{
public:

	//サウンドの情報を格納する構造体
	struct SoundInfo
	{
		enSoundList Id;
		std::wstring Path;
		std::wstring Name;
	};

public:
	CSoundManager();
	~CSoundManager();


	/*****************************************************************************************
	* @brief    サウンド管理mapの添え字宣言とインスタンス作成
	* @return   S_OK:成功, 
	*			E_FAIL:失敗
	*****************************************************************************************/
	HRESULT Create();

	/*****************************************************************************************
	* @brief    サウンドの読み込み
	* @param    hWnd: ウィンドウハンドル
	* @return   S_OK:成功, 
	*			E_FAIL:失敗
	*****************************************************************************************/
	HRESULT LoadData(HWND hWnd);


	/*****************************************************************************************
	* @brief    SEを再生する
	* @param    再生したいSEのID
	*****************************************************************************************/
	void PlaySE(enSoundList soundId) {
		m_pSound[soundId]->PlaySE();
	}

	/*****************************************************************************************
	* @brief    音をループ再生する
	* @param    再生したい音のID
	*****************************************************************************************/
	void PlayLoop(enSoundList soundId) {
		m_pSound[soundId]->PlayLoop();
	}

	/*****************************************************************************************
	* @brief    音を停止する
	* @param    停止したい音のID
	*****************************************************************************************/
	void Stop(enSoundList soundId) {
		m_pSound[soundId]->Stop();
	}

private:

	// サウンド管理用のmap
	std::unordered_map<enSoundList,std::shared_ptr<CSound>> m_pSound;

	//サウンド情報のリスト
	std::vector<SoundInfo> m_SoundInfoList;	

};